# UV Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnFace..::..UV Property
PointOnFace Class See Also
---
The location of the point in the surface's coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV UV { get; set; }
```

Visual Basic
---
```text
Public Property UV As UV
	Get
	Set
```

Visual C++
---
```text
public:
property UV^ UV {
	UV^ get ();
	void set (UV^ value);
}
```

# See Also
PointOnFace Class
Autodesk.Revit.DB Namespace